# Понятие о структурном программировании

Структурное программирование - парадигма разработки программ с помощью представления их в виде иерархической структуры блоков. Сюда входит три пункта:

1. Любая программа состоит из трех типов конструкций: последовательное исполнение, ветвление, цикл.
2. Логически целостные фрагменты программы оформляются в виде подпрограмм. В тексте основной программы вставляется инструкция вызова подпрограммы. После окончания подпрограммы исполнение продолжается с инструкции, следующей за командой вызова подпрограммы.
3. Разработка программы ведется поэтапно методом "сверху вниз".

Первый пункт скорее важен не тем, что в нем есть, а тем, чего в нем нет: в нем нет оператора безусловного перехода **goto**. Именно это отличает структурное программирование от процедурного. Благодаря пункту два в языках высокого уровня появились новые синтаксические конструкции: функции и процедуры.

Пункт три самый важный и является сутью парадигмы структурного программирования.

## Проектирование "сверху вниз"

Как было сказано выше, сама суть структурного программирования лежит в подходе к проектированию программы. Для понимания этого приведем процесс решения конкретной задачи во времени.

**Условие.** Пусть в некоторой стране зарплата сотрудника дорожной патрульной службы состоит из штрафов, накладываемых на водителей за превышение скорости в 60 км/ч, штраф напрямую зависит от номера автомобиля, а рабочий день заканчивается с приездом начальника, при этом начальника штрафовать нельзя. Требуется посчитать зарплату сотрудника за день.

Входные данные подаются построчно, в каждой строке - скорость (целое число) и номер автомобиля (6 символов - 1 буква, 3 цифры и еще 2 буквы).

Штраф для автомобильных номеров зависит от количества совпадающих цифр: три совпадают - 1000 у.е., две любые цифры совпадают - 500 у.е., все цифры разные - 100 у.е.

**Примечание:** все комментарии в примерах будут на русском языке, что нарушает PEP 8. Это сделано для простоты восприятия примера.

**Шаг №1.** Предположим, что все уже написано для нас:

```python
def main():
    salary = calculate_salary()
    print(salary)


if __name__ == "__main__":
    main()
```

**Шаг №2.** Но это не будет работать, так как функция calculate_salary отсутствует. Исправим это:

```python
def main():
    salary = calculate_salary()
    print(salary)


def calculate_salary():
    """
    Функция считает зарплату сотрудника ДПС, считывая исходные данные с клавиатуры.
    
    :returns: Зарплата сотрудника
    
    .. todo:: Реализовать функцию
    """
    pass


if __name__ == "__main__":
    main()
```

Теперь код будет успешно выполняться, но сейчас функция ничего не делает. В документации к функции явно указано, что ее надо реализовать. Такая функция называется заглушкой и широко используется в практике программирования.

**Шаг №3.** Займемся реализацией функции. Предположим, что у нас написаны все необходимые функции, и напишем `calculate_salary` так:

```python
def calculate_salary():
    """
    Функция считает зарплату сотрудника ДПС, считывая исходные данные с клавиатуры.

    :returns: Зарплата сотрудника
    """
    sum_of_fines = 0
    speed_of_car, number_of_car = read_data()
    while not detect_chief(number_of_car):
        if speed_of_car > 60:
            sum_of_fines += calculate_fine(number_of_car)
        speed_of_car, number_of_car = read_data()
    return sum_of_fines
```